Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData
Struct for simple parameter data.
Remarks:
Matches dotDMParameterData_t on TS Core side.

Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData.MaxStringLength
The System.Runtime.InteropServices.MarshalAsAttribute.SizeConst value of Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData.ParameterString.

Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData.ParameterNumber
The numeric parameter data.

Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData.ParameterString
The textual parameter data.